teomaras76/AI_on_STM32_Gesture_recognition/STM32 Sensortile FW project/Drivers/BSP/SensorTile/SensorTile_audio_in.c
/**
******************************************************************************
* @file    SensorTile_audio_in.c
* @author  Central Labs
* @version V1.3.3
 * @date   27-Sep-2017
* @brief   This file provides the Audio In driver for the SensorTile
*          board
*******************************************************************************
* @attention
*
* <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
*
* Redistribution and use in source and binary forms, with or without modification,
* are permitted provided that the following conditions are met:
*   1. Redistributions of source code must retain the above copyright notice,
*      this list of conditions and the following disclaimer.
*   2. Redistributions in binary form must reproduce the above copyright notice,
*      this list of conditions and the following disclaimer in the documentation
*      and/or other materials provided with the distribution.
*   3. Neither the name of STMicroelectronics nor the names of its contributors
*      may be used to endorse or promote products derived from this software
*      without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
* FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
* DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
* CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
* OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
* OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************
*/

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"
#include "SensorTile_audio_in.h"

/** @addtogroup BSP
* @{
*/

/** @addtogroup SENSORTILE
* @{
*/

/** @addtogroup SENSORTILE_AUDIO_IN
* @brief This file provides a set of firmware functions to manage MEMS microphones
* @{
*/ 

/** @defgroup SENSORTILE_AUDIO_IN_Private_Types SENSORTILE_AUDIO_IN Private Types
* @{
*/ 

/**
* @}
*/ 

/** @defgroup SENSORTILE_AUDIO_IN_Private_Defines SENSORTILE_AUDIO_IN Private Defines
* @{
*/ 

/**
* @}
*/ 

/** @defgroup SENSORTILE_AUDIO_IN_Private_Macros SENSORTILE_AUDIO_IN Private Macros
* @{
*/

#define SaturaLH(N, L, H) (((N)<(L))?(L):(((N)>(H))?(H):(N)))

#define OverSampling(__FREQUENCY__) \
((__FREQUENCY__ == AUDIO_FREQUENCY_8K)  ? 256 \
  : (__FREQUENCY__ == AUDIO_FREQUENCY_11K) ? 256 \
    : (__FREQUENCY__ == AUDIO_FREQUENCY_16K) ? 128 \
      : (__FREQUENCY__ == AUDIO_FREQUENCY_22K) ? 128 \
        : (__FREQUENCY__ == AUDIO_FREQUENCY_32K) ? 64 \
          : (__FREQUENCY__ == AUDIO_FREQUENCY_44K) ? 64  \
            : (__FREQUENCY__ == AUDIO_FREQUENCY_48K) ? 64  \
              : (__FREQUENCY__ == AUDIO_FREQUENCY_96K) ? 32 : 32)  

#define ClockDivider(__FREQUENCY__) \
((__FREQUENCY__ == AUDIO_FREQUENCY_8K)  ? 24 \
  : (__FREQUENCY__ == AUDIO_FREQUENCY_11K) ? 4 \
    : (__FREQUENCY__ == AUDIO_FREQUENCY_16K) ? 24 \
      : (__FREQUENCY__ == AUDIO_FREQUENCY_22K) ? 4 \
        : (__FREQUENCY__ == AUDIO_FREQUENCY_32K) ? 24 \
          : (__FREQUENCY__ == AUDIO_FREQUENCY_44K) ? 4  \
            : (__FREQUENCY__ == AUDIO_FREQUENCY_48K) ? 16  \
              : (__FREQUENCY__ == AUDIO_FREQUENCY_96K) ? 16 : 16)

/**
* @}
*/ 

/** @defgroup SENSORTILE_AUDIO_IN_Private_Variables SENSORTILE_AUDIO_IN Private Variables
* @{
*/

static SENSORTILE_AudioIn_HandlerTypeDef SENSORTILE_AudioIn_Handler;
DFSDM_Channel_HandleTypeDef haudio_in_dfsdmchannel[MAX_CH_NUMBER];
DFSDM_Filter_HandleTypeDef haudio_in_dfsdmfilter[MAX_CH_NUMBER];
DMA_HandleTypeDef hdma_dfsdmReg_FLT[MAX_CH_NUMBER];
int32_t RecBuff[MAX_CH_NUMBER][MAX_SAMPLES_PER_CH];
static uint16_t AudioInVolume = DEFAULT_AUDIO_IN_VOLUME;

/**
* @}
*/ 

/** @defgroup SENSORTILE_AUDIO_IN_Private_Function_Prototypes SENSORTILE_AUDIO_IN Private Function Prototypes
* @{
*/ 

static void DFSDMx_FilterMspInit(DFSDM_Filter_HandleTypeDef *hdfsdm_filter);
static uint8_t DFSDMx_Init(uint32_t AudioFreq, uint32_t ChnlNbr);
static uint8_t DFSDMx_DeInit(void);
static void DFSDMx_ChannelMspDeInit(DFSDM_Channel_HandleTypeDef *hdfsdm_channel);
static void DFSDMx_FilterMspDeInit(DFSDM_Filter_HandleTypeDef *hdfsdm_filter);

/**
* @}
*/ 

/** @defgroup SENSORTILE_AUDIO_IN_Exported_Functions SENSORTILE_AUDIO_IN Exported Functions
* @{
*/   

/**
* @brief  Initializes audio acquisition.
* @param  AudioFreq: Audio frequency to be configured for the peripherals.
* 		  Possible values are 8000, 16000, 32000, 48000 OR 96000 Hz
* @param  BitRes: Not used in this release.
* @param  ChnlNbr: Number of channel to be configured.
* @note   if ChnlNbr == 1, the onboard microphone is acquired
*         if ChnlNbr == 2, two external microphones connected to "GPIO2" are acquired 
*         if ChnlNbr == 4, four external microphones connected to "GPIO2" and "GPIO3" are acquired 
* @retval AUDIO_OK if correct communication, else wrong communication
*/
uint8_t BSP_AUDIO_IN_Init(uint32_t AudioFreq, uint32_t BitRes, uint32_t ChnlNbr) 
{
  
  /*Set Structure for internal state*/
  SENSORTILE_AudioIn_Handler.MicChannels = ChnlNbr;
  SENSORTILE_AudioIn_Handler.Sampling_Freq = AudioFreq;
  
  /*PLL and Clocks config*/
  BSP_AUDIO_IN_ClockConfig(SENSORTILE_AudioIn_Handler.Sampling_Freq, NULL);
  
  /*DFSDM configuration*/
  return DFSDMx_Init(AudioFreq, ChnlNbr);
}

/**
* @brief  DeInitializes the audio peripheral.
* @retval None
*/
uint8_t BSP_AUDIO_IN_DeInit(void)
{
  return DFSDMx_DeInit();
}


/**
* @brief  Clock Config.
* @param  Params: additional parameters where required
* @param  AudioFreq: Audio frequency used to play the audio stream.
* @note   This API is called by BSP_AUDIO_IN_Init() 
*         Being __weak it can be overwritten by the application     
* @retval AUDIO_OK if no problem during execution, AUDIO_ERROR otherwise
*/
__weak uint8_t BSP_AUDIO_IN_ClockConfig(uint32_t AudioFreq, void *Params)
{ 
  RCC_PeriphCLKInitTypeDef RCC_ExCLKInitStruct;
  RCC_ExCLKInitStruct.PLLSAI1.PLLSAI1N = 43;
  RCC_ExCLKInitStruct.PLLSAI1.PLLSAI1P = 7;
  
  /* Configure PLLSAI */
    /* Please note that some of these parameters must be consistent with 
  the xonfiguration of the main PLL */
  RCC_ExCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SAI1;
  RCC_ExCLKInitStruct.PLLSAI1.PLLSAI1ClockOut = RCC_PLLSAI1_SAI1CLK;
  RCC_ExCLKInitStruct.Sai1ClockSelection = RCC_SAI1CLKSOURCE_PLLSAI1;
  RCC_ExCLKInitStruct.PLLSAI1.PLLSAI1Source = RCC_PLLSOURCE_MSI;
  RCC_ExCLKInitStruct.PLLSAI1.PLLSAI1M = 6;  
  
  if(HAL_RCCEx_PeriphCLKConfig(&RCC_ExCLKInitStruct) != HAL_OK)
  {
    return AUDIO_ERROR;
  }
  
