teomaras76/AI_on_STM32_Gesture_recognition/STM32 Sensortile FW project/Drivers/BSP/SensorTile/SensorTile_audio_in.c
  return AUDIO_OK;
}

/**
* @brief  Starts audio recording.
* @param  * pbuf: Buffer that will contain 1 ms of PCM for each microphone.
Its dimension must be equal to (in uint16_t words): 
((PCM sampling frequency)/1000 * Channels)				  
* @param  size: Not used in this driver.
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise 
*/
uint8_t BSP_AUDIO_IN_Record(uint16_t* pbuf, uint32_t size) 
{  
  int32_t counter = 0;
  SENSORTILE_AudioIn_Handler.PCM_Data = pbuf;
  
  for (counter = SENSORTILE_AudioIn_Handler.MicChannels; counter > 0; counter --)
  {
    if (HAL_OK != HAL_DFSDM_FilterRegularStart_DMA(&haudio_in_dfsdmfilter[counter-1],
                                                   (int32_t*) RecBuff[counter-1],
                                                   SENSORTILE_AudioIn_Handler.Sampling_Freq / 1000 * 2)) 
    {
      return AUDIO_ERROR;
    }    
  }
  return AUDIO_OK;
}

/**
* @brief  Stops audio recording.
* @param  None
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise 
*/
uint8_t BSP_AUDIO_IN_Stop(void) 
{
  int32_t counter = 0;
  for (counter = SENSORTILE_AudioIn_Handler.MicChannels; counter > 0; counter --)
  {
    if (HAL_OK != HAL_DFSDM_FilterRegularStop_DMA(&haudio_in_dfsdmfilter[counter-1])) 
    {
      return AUDIO_ERROR;
    }    
  }
  /* Return 0 if all operations are OK */
  return AUDIO_OK;
}


/**
* @brief  Pauses the audio file stream.
* @param  None
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise 
*/
uint8_t BSP_AUDIO_IN_Pause(void)
{    
  int32_t counter = 0;
  for (counter = SENSORTILE_AudioIn_Handler.MicChannels; counter > 0; counter --)
  {
    if (HAL_OK != HAL_DFSDM_FilterRegularStop_DMA(&haudio_in_dfsdmfilter[counter-1])) 
    {
      return AUDIO_ERROR;
    }    
  }
  /* Return 0 if all operations are OK */
  return AUDIO_OK;
}

/**
* @brief  Resumes the audio file stream.
* @param  None    
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise 
*/
uint8_t BSP_AUDIO_IN_Resume(void)
{    
  int32_t counter = 0;
  for (counter = SENSORTILE_AudioIn_Handler.MicChannels; counter > 0; counter --)
  {
    if (HAL_OK != HAL_DFSDM_FilterRegularStart_DMA(&haudio_in_dfsdmfilter[counter-1],
                                                   (int32_t*) RecBuff[counter-1],
                                                   SENSORTILE_AudioIn_Handler.Sampling_Freq / 1000 * 2)) 
    {
      return AUDIO_ERROR;
    }    
  }
  return AUDIO_OK;
}


/**
* @brief  Controls the audio in volume level.
* @param  Volume: Volume level to be set. This value has the same behaviour of the 	
Volume parameter of the PDM to PCM software decimation library. Other
strategies are possible in order to control the volume, for example
to act on the right bit shift amount of the DFSDM peripheral
Values must be in the range from 0 to 64
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise 
*/
uint8_t BSP_AUDIO_IN_SetVolume(uint8_t Volume) 
{
  AudioInVolume = Volume;
  return AUDIO_OK;
}

/**
* @brief  Audio IN Error callback function
* @param  None
* @retval None
*/
__weak void BSP_AUDIO_IN_Error_Callback(void) 
{
  /* This function is called when an Interrupt due to transfer error on or peripheral
  error occurs. */
}

/**
* @}
*/

/** @defgroup SENSORTILE_AUDIO_IN_Private_Functions SENSORTILE_AUDIO_IN Private Functions
* @{
*/ 

/**
* @brief  Initializes the Digital Filter for Sigma-Delta Modulators interface (DFSDM).
* @param  AudioFreq: Audio frequency to be used to set correctly the DFSDM peripheral.
* @retval AUDIO_OK if correct communication, else wrong communication
*/
static uint8_t DFSDMx_Init(uint32_t AudioFreq, uint32_t ChnlNbr) 
{  
  uint16_t shift_amount = 0;
  uint32_t SincOrder = 0;
  if(OverSampling(AudioFreq) == 32)
  {
    shift_amount = 5;
    SincOrder = DFSDM_FILTER_SINC5_ORDER;
  }
  else if(OverSampling(AudioFreq) == 128)
  {
    shift_amount = 8;
    SincOrder = DFSDM_FILTER_SINC4_ORDER;
  }
  else if(OverSampling(AudioFreq) == 64)
  {
    shift_amount = 10;
    SincOrder = DFSDM_FILTER_SINC5_ORDER;
  }
  else if(OverSampling(AudioFreq) == 256)
  {
    shift_amount = 4;
    SincOrder = DFSDM_FILTER_SINC3_ORDER;
  } 
  
  if (ChnlNbr == 1)
  {
    /*####AUDIO CH 1: DFSDM CHANNEL 2####*/
    haudio_in_dfsdmchannel[0].Init.OutputClock.Activation   = ENABLE;
    haudio_in_dfsdmchannel[0].Init.OutputClock.Selection    = DFSDM_CHANNEL_OUTPUT_CLOCK_AUDIO;
    /* Set the DFSDM clock OUT audio frequency configuration */
    haudio_in_dfsdmchannel[0].Init.OutputClock.Divider      = ClockDivider(AudioFreq);
    haudio_in_dfsdmchannel[0].Init.Input.Multiplexer        = DFSDM_CHANNEL_EXTERNAL_INPUTS;
    haudio_in_dfsdmchannel[0].Init.Input.DataPacking        = DFSDM_CHANNEL_STANDARD_MODE;
    haudio_in_dfsdmchannel[0].Init.Input.Pins               = DFSDM_CHANNEL_SAME_CHANNEL_PINS;
    haudio_in_dfsdmchannel[0].Init.SerialInterface.Type     = DFSDM_CHANNEL_SPI_RISING;
    haudio_in_dfsdmchannel[0].Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
    haudio_in_dfsdmchannel[0].Init.Awd.FilterOrder          = DFSDM_CHANNEL_SINC1_ORDER;
    haudio_in_dfsdmchannel[0].Init.Awd.Oversampling         = 10;
    haudio_in_dfsdmchannel[0].Init.Offset                   = 0;
    haudio_in_dfsdmchannel[0].Init.RightBitShift            = shift_amount;
    haudio_in_dfsdmchannel[0].Instance                      = DFSDM_Channel5;
    
    if(HAL_DFSDM_ChannelGetState(&haudio_in_dfsdmchannel[0]) == HAL_DFSDM_CHANNEL_STATE_RESET)
    {
      /* Init the DFSDM Channel */
      GPIO_InitTypeDef GPIO_InitStruct;
      
      /* Enable DFSDM clock */
      AUDIO_IN_DFSDM_CLK_ENABLE();  
      /* Enable GPIO clock */
      AUDIO_IN_DFSDM_CKOUT_GPIO_CLK_ENABLE(); 
      AUDIO_IN_DFSDM_CH12_DATAIN_GPIO_CLK_ENABLE();
      
      /* DFSDM pins configuration: DFSDM_CKOUT, DMIC_DATIN pins ------------------*/
      GPIO_InitStruct.Pin = AUDIO_IN_DFSDM_CKOUT_PIN;
      GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Pull = GPIO_NOPULL;
      GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
      GPIO_InitStruct.Alternate = AUDIO_IN_DFSDM_CKOUT_DATIN_AF;
      HAL_GPIO_Init(AUDIO_IN_DFSDM_CKOUT_GPIO_PORT, &GPIO_InitStruct);
      
      GPIO_InitStruct.Pin = AUDIO_IN_DFSDM_CH12_DATIN_PIN;
      GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Pull = GPIO_NOPULL;
      GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
      GPIO_InitStruct.Alternate = AUDIO_IN_DFSDM_CKOUT_DATIN_AF;
      HAL_GPIO_Init(AUDIO_IN_DFSDM_CH12_DATIN_GPIO_PORT, &GPIO_InitStruct); 
    }
    
    if(HAL_OK != HAL_DFSDM_ChannelInit(&haudio_in_dfsdmchannel[0]))
    {
      return AUDIO_ERROR;
    } 
    
    /*####AUDIO CH 1: FILTER 0####*/
    haudio_in_dfsdmfilter[0].Init.RegularParam.Trigger         = DFSDM_FILTER_SW_TRIGGER;
    haudio_in_dfsdmfilter[0].Init.RegularParam.FastMode        = ENABLE;
    haudio_in_dfsdmfilter[0].Init.RegularParam.DmaMode         = ENABLE;
    haudio_in_dfsdmfilter[0].Init.InjectedParam.Trigger        = DFSDM_FILTER_SW_TRIGGER;
    haudio_in_dfsdmfilter[0].Init.InjectedParam.ScanMode       = DISABLE;
    haudio_in_dfsdmfilter[0].Init.InjectedParam.DmaMode        = DISABLE;
    haudio_in_dfsdmfilter[0].Init.InjectedParam.ExtTrigger     = DFSDM_FILTER_EXT_TRIG_TIM8_TRGO;
    haudio_in_dfsdmfilter[0].Init.InjectedParam.ExtTriggerEdge = DFSDM_FILTER_EXT_TRIG_BOTH_EDGES;
    haudio_in_dfsdmfilter[0].Init.FilterParam.SincOrder        = SincOrder;
    /* Set the DFSDM Filters Oversampling to have correct sample rate */
    haudio_in_dfsdmfilter[0].Init.FilterParam.Oversampling     = OverSampling(AudioFreq);
    haudio_in_dfsdmfilter[0].Init.FilterParam.IntOversampling  = 1;  
    haudio_in_dfsdmfilter[0].Instance                          = AUDIO_IN_DFSDM_1st_FILTER;
    
    if(HAL_DFSDM_FilterGetState(&haudio_in_dfsdmfilter[0]) == HAL_DFSDM_FILTER_STATE_RESET)
    {
      /* Init the DFSDM Filter */
      DFSDMx_FilterMspInit(&haudio_in_dfsdmfilter[0]);
    }
    
    if(HAL_OK != HAL_DFSDM_FilterInit(&haudio_in_dfsdmfilter[0]))
    {
      return AUDIO_ERROR;
    }
    
    /* Configure injected channel */
    if(HAL_OK != HAL_DFSDM_FilterConfigRegChannel(&haudio_in_dfsdmfilter[0], DFSDM_CHANNEL_5, DFSDM_CONTINUOUS_CONV_ON))
    {
      return AUDIO_ERROR;
    }
  }
  else {
    
    if (ChnlNbr >= 2)
    {  
      
      /*####AUDIO CH 1: DFSDM CHANNEL 2####*/
      haudio_in_dfsdmchannel[0].Init.OutputClock.Activation   = ENABLE;
      haudio_in_dfsdmchannel[0].Init.OutputClock.Selection    = DFSDM_CHANNEL_OUTPUT_CLOCK_AUDIO;
      /* Set the DFSDM clock OUT audio frequency configuration */
      haudio_in_dfsdmchannel[0].Init.OutputClock.Divider      = ClockDivider(AudioFreq);
      haudio_in_dfsdmchannel[0].Init.Input.Multiplexer        = DFSDM_CHANNEL_EXTERNAL_INPUTS;
      haudio_in_dfsdmchannel[0].Init.Input.DataPacking        = DFSDM_CHANNEL_STANDARD_MODE;
      haudio_in_dfsdmchannel[0].Init.Input.Pins               = DFSDM_CHANNEL_SAME_CHANNEL_PINS;
      haudio_in_dfsdmchannel[0].Init.SerialInterface.Type     = DFSDM_CHANNEL_SPI_RISING;
      haudio_in_dfsdmchannel[0].Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
      haudio_in_dfsdmchannel[0].Init.Awd.FilterOrder          = DFSDM_CHANNEL_SINC1_ORDER;
      haudio_in_dfsdmchannel[0].Init.Awd.Oversampling         = 10;
      haudio_in_dfsdmchannel[0].Init.Offset                   = 0;
      haudio_in_dfsdmchannel[0].Init.RightBitShift            = shift_amount;
      haudio_in_dfsdmchannel[0].Instance                      = DFSDM_Channel6;
      
      if(HAL_DFSDM_ChannelGetState(&haudio_in_dfsdmchannel[0]) == HAL_DFSDM_CHANNEL_STATE_RESET)
      {
        /* Init the DFSDM Channel msp */   
        GPIO_InitTypeDef GPIO_InitStruct;
        
