teomaras76/AI_on_STM32_Gesture_recognition/STM32 Sensortile FW project/Drivers/BSP/SensorTile/SensorTile_audio_in.c
        GPIO_InitStruct.Pin = AUDIO_IN_DFSDM_CH34_EXT_DATIN_PIN;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
        GPIO_InitStruct.Alternate = AUDIO_IN_DFSDM_CKOUT_DATIN_AF;
        HAL_GPIO_Init(AUDIO_IN_DFSDM_CH34_EXT_DATIN_GPIO_PORT, &GPIO_InitStruct);
        
        
      }    
      if(HAL_OK != HAL_DFSDM_ChannelInit(&haudio_in_dfsdmchannel[2]))
      {
        return AUDIO_ERROR;
      }  
      
      /*####AUDIO CH 3: FILTER 2####*/
      haudio_in_dfsdmfilter[2].Init.RegularParam.Trigger         = DFSDM_FILTER_SYNC_TRIGGER;
      haudio_in_dfsdmfilter[2].Init.RegularParam.FastMode        = ENABLE;
      haudio_in_dfsdmfilter[2].Init.RegularParam.DmaMode         = ENABLE;
      haudio_in_dfsdmfilter[2].Init.InjectedParam.Trigger        = DFSDM_FILTER_SW_TRIGGER;
      haudio_in_dfsdmfilter[2].Init.InjectedParam.ScanMode       = DISABLE;
      haudio_in_dfsdmfilter[2].Init.InjectedParam.DmaMode        = DISABLE;
      haudio_in_dfsdmfilter[2].Init.InjectedParam.ExtTrigger     = DFSDM_FILTER_EXT_TRIG_TIM8_TRGO;
      haudio_in_dfsdmfilter[2].Init.InjectedParam.ExtTriggerEdge = DFSDM_FILTER_EXT_TRIG_BOTH_EDGES;
      haudio_in_dfsdmfilter[2].Init.FilterParam.SincOrder        = SincOrder;
      /* Set the DFSDM Filters Oversampling to have correct sample rate */
      haudio_in_dfsdmfilter[2].Init.FilterParam.Oversampling     = OverSampling(AudioFreq);
      haudio_in_dfsdmfilter[2].Init.FilterParam.IntOversampling  = 1;    
      haudio_in_dfsdmfilter[2].Instance                          = AUDIO_IN_DFSDM_3rd_FILTER;
      
      if(HAL_DFSDM_FilterGetState(&haudio_in_dfsdmfilter[2]) == HAL_DFSDM_FILTER_STATE_RESET)
      {
        /* Init the DFSDM Filter */
        DFSDMx_FilterMspInit(&haudio_in_dfsdmfilter[2]);
      }  
      
      if(HAL_OK != HAL_DFSDM_FilterInit(&haudio_in_dfsdmfilter[2]))
      {
        return AUDIO_ERROR;
      }   
      
      /* Configure injected channel */
      if(HAL_OK != HAL_DFSDM_FilterConfigRegChannel(&haudio_in_dfsdmfilter[2], DFSDM_CHANNEL_4, DFSDM_CONTINUOUS_CONV_ON))
      {
        return AUDIO_ERROR;
      }
      
      /*####AUDIO CH 4: CHANNEL 6####*/
      haudio_in_dfsdmchannel[3].Init.OutputClock.Activation   = ENABLE;
      haudio_in_dfsdmchannel[3].Init.OutputClock.Selection    = DFSDM_CHANNEL_OUTPUT_CLOCK_AUDIO;
      /* Set the DFSDM clock OUT audio frequency configuration */
      haudio_in_dfsdmchannel[3].Init.OutputClock.Divider      = ClockDivider(AudioFreq);
      haudio_in_dfsdmchannel[3].Init.Input.Multiplexer        = DFSDM_CHANNEL_EXTERNAL_INPUTS;
      haudio_in_dfsdmchannel[3].Init.Input.DataPacking        = DFSDM_CHANNEL_STANDARD_MODE;
      haudio_in_dfsdmchannel[3].Init.Input.Pins               = DFSDM_CHANNEL_FOLLOWING_CHANNEL_PINS;
      haudio_in_dfsdmchannel[3].Init.SerialInterface.Type     = DFSDM_CHANNEL_SPI_FALLING;
      haudio_in_dfsdmchannel[3].Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
      haudio_in_dfsdmchannel[3].Init.Awd.FilterOrder          = DFSDM_CHANNEL_SINC1_ORDER;
      haudio_in_dfsdmchannel[3].Init.Awd.Oversampling         = 10;
      haudio_in_dfsdmchannel[3].Init.Offset                   = 0;
      haudio_in_dfsdmchannel[3].Init.RightBitShift            = shift_amount;    
      haudio_in_dfsdmchannel[3].Instance                      = DFSDM_Channel3;
      
      if(HAL_OK != HAL_DFSDM_ChannelInit(&haudio_in_dfsdmchannel[3]))
      {
        return AUDIO_ERROR;
      }
      
      /*####AUDIO CH 4: FILTER 3####*/
      haudio_in_dfsdmfilter[3].Init.RegularParam.Trigger         = DFSDM_FILTER_SYNC_TRIGGER;
      haudio_in_dfsdmfilter[3].Init.RegularParam.FastMode        = ENABLE;
      haudio_in_dfsdmfilter[3].Init.RegularParam.DmaMode         = ENABLE;
      haudio_in_dfsdmfilter[3].Init.InjectedParam.Trigger        = DFSDM_FILTER_SW_TRIGGER;
      haudio_in_dfsdmfilter[3].Init.InjectedParam.ScanMode       = DISABLE;
      haudio_in_dfsdmfilter[3].Init.InjectedParam.DmaMode        = DISABLE;
      haudio_in_dfsdmfilter[3].Init.InjectedParam.ExtTrigger     = DFSDM_FILTER_EXT_TRIG_TIM8_TRGO;
      haudio_in_dfsdmfilter[3].Init.InjectedParam.ExtTriggerEdge = DFSDM_FILTER_EXT_TRIG_BOTH_EDGES;
      haudio_in_dfsdmfilter[3].Init.FilterParam.SincOrder        = SincOrder;
      /* Set the DFSDM Filters Oversampling to have correct sample rate */
      haudio_in_dfsdmfilter[3].Init.FilterParam.Oversampling     = OverSampling(AudioFreq);
      haudio_in_dfsdmfilter[3].Init.FilterParam.IntOversampling  = 1;    
      haudio_in_dfsdmfilter[3].Instance                          = AUDIO_IN_DFSDM_4th_FILTER;
      
      if(HAL_DFSDM_FilterGetState(&haudio_in_dfsdmfilter[3]) == HAL_DFSDM_FILTER_STATE_RESET)
      {
        /* Init the DFSDM Filter */
        DFSDMx_FilterMspInit(&haudio_in_dfsdmfilter[3]);
      }
      
      if(HAL_OK != HAL_DFSDM_FilterInit(&haudio_in_dfsdmfilter[3]))
      {
        return AUDIO_ERROR;
      }
      
      /* Configure injected channel */
      if(HAL_OK != HAL_DFSDM_FilterConfigRegChannel(&haudio_in_dfsdmfilter[3], DFSDM_CHANNEL_3, DFSDM_CONTINUOUS_CONV_ON))
      {
        return AUDIO_ERROR;
      }
    } 
  }
  
  
 
  
  return AUDIO_OK;
}

/**
* @brief  Initializes the DFSDM filter MSP.
* @param  hdfsdm_filter : DFSDM filter handle.
* @retval None
*/
static void DFSDMx_FilterMspInit(DFSDM_Filter_HandleTypeDef *hdfsdm_filter) 
{
  DMA_HandleTypeDef *hdma_dfsdmReg=NULL;
  
  /* Enable DFSDM clock */
  AUDIO_IN_DFSDM_CLK_ENABLE();  
  /* Enable the DMA clock */
  AUDIO_IN_DFSDM_DMA_CLK_ENABLE() ;
  
  if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_1st_FILTER) 
  {
    hdma_dfsdmReg = &hdma_dfsdmReg_FLT[0];
  } 
  else if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_2st_FILTER) 
  {
    hdma_dfsdmReg = &hdma_dfsdmReg_FLT[1];
  } 
  else if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_3rd_FILTER) 
  {
    hdma_dfsdmReg = &hdma_dfsdmReg_FLT[2];
  } 
  else if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_4th_FILTER) 
  {
    hdma_dfsdmReg = &hdma_dfsdmReg_FLT[3];
  }
  
  /* Configure the hdma_dfsdmReg handle parameters */
  hdma_dfsdmReg->Init.Request = DMA_REQUEST_0;
  hdma_dfsdmReg->Init.Direction = DMA_PERIPH_TO_MEMORY;
  hdma_dfsdmReg->Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_dfsdmReg->Init.MemInc = DMA_MINC_ENABLE;
  hdma_dfsdmReg->Init.PeriphDataAlignment = AUDIO_IN_DFSDM_DMA_PERIPH_DATA_SIZE;
  hdma_dfsdmReg->Init.MemDataAlignment = AUDIO_IN_DFSDM_DMA_MEM_DATA_SIZE;
  hdma_dfsdmReg->Init.Mode = DMA_CIRCULAR;
  hdma_dfsdmReg->Init.Priority = DMA_PRIORITY_HIGH;
  
  if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_1st_FILTER) 
  {
    hdma_dfsdmReg->Instance = AUDIO_IN_DFSDM_DMA_1st_CHANNEL;
  } 
  else if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_2st_FILTER) 
  {
    hdma_dfsdmReg->Instance = AUDIO_IN_DFSDM_DMA_2nd_CHANNEL;
  } 
  else if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_3rd_FILTER) 
  {
    hdma_dfsdmReg->Instance = AUDIO_IN_DFSDM_DMA_3rd_CHANNEL;
  } 
  else if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_4th_FILTER) 
  {
    hdma_dfsdmReg->Instance = AUDIO_IN_DFSDM_DMA_4th_CHANNEL;
  }
  
  /* Associate the DMA handle */
  __HAL_LINKDMA(hdfsdm_filter, hdmaReg, *hdma_dfsdmReg);
  
  /* Reset DMA handle state */
  __HAL_DMA_RESET_HANDLE_STATE(hdma_dfsdmReg);
  
  /* Configure the DMA Channel */
  HAL_DMA_Init(hdma_dfsdmReg);
  
  /* DMA IRQ Channel configuration */
  if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_1st_FILTER) 
  {
    HAL_NVIC_SetPriority(AUDIO_IN_DFSDM_DMA_1st_CH_IRQn,
                         AUDIO_IN_IRQ_PREPRIO, 0);
    HAL_NVIC_EnableIRQ(AUDIO_IN_DFSDM_DMA_1st_CH_IRQn);
  } 
}

/**
* @brief  De-initializes the Digital Filter for Sigma-Delta Modulators interface (DFSDM).
* @retval AUDIO_OK if correct communication, else wrong communication
*/
static uint8_t DFSDMx_DeInit(void)
{
  /* De-initializes the DFSDM filters to allow access to DFSDM internal registers */
  uint16_t index = 0;
  
  for (index = 0; index < SENSORTILE_AudioIn_Handler.MicChannels; index ++)
  {
    if(HAL_OK != HAL_DFSDM_FilterDeInit(&haudio_in_dfsdmfilter[index]))
    {
      return AUDIO_ERROR;
    }  
    if(HAL_OK != HAL_DFSDM_ChannelDeInit(&haudio_in_dfsdmchannel[index]))
    {
      return AUDIO_ERROR;
    }     
    DFSDMx_FilterMspDeInit(&haudio_in_dfsdmfilter[index]);  
    DFSDMx_ChannelMspDeInit(&haudio_in_dfsdmchannel[index]);    
  }
  
